AuditLogs
| where TimeGenerated {TimeRange}
| where Result =~ "success"
| where OperationName has_any ("security info", "authentication method", "MFA", "Authenticator", "FIDO", "passwordless")
| mv-expand TargetResources
| extend TargetType = tostring(TargetResources.type)
| extend TargetName = tostring(TargetResources.displayName)
| project TimeGenerated, OperationName, InitiatedBy, TargetType, TargetName, CorrelationId, TargetResources
| order by TimeGenerated desc
